InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Валюта, по отношению к которой хранится курс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Подставим значения по умолчанию в ДанныеЗаполнения
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		ДанныеЗаполнения = Новый Структура;
	КонецЕсли; 
	Если НЕ ДанныеЗаполнения.Свойство("БазоваяВалюта") ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.БазоваяВалюта) Тогда
		ДанныеЗаполнения.Вставить("БазоваяВалюта", Константы.ВалютаУчета.Получить());
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Валюта") И ЗначениеЗаполнено(ДанныеЗаполнения.Валюта) 
			И (НЕ ДанныеЗаполнения.Свойство("Кратность") ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Кратность)) Тогда
		ДатаКурса = ?(ДанныеЗаполнения.Свойство("Период") И ЗначениеЗаполнено(ДанныеЗаполнения.Период), ДанныеЗаполнения.Период, ТекущаяДата());
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеЗаполнения.Валюта, ДатаКурса, ДанныеЗаполнения.БазоваяВалюта);
	Иначе
		КурсИКратность = Новый Структура("Курс,Кратность", 0, 1);
	КонецЕсли;
	 
	Если НЕ ДанныеЗаполнения.Свойство("Кратность") ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Кратность) Тогда
		ДанныеЗаполнения.Вставить("Кратность", КурсИКратность.Кратность);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Формируем представление курса Для отображения в списках
	// Представление должно быть записано независимо от загрузки - в истоничках данных его нет
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		ЗаписьНабора.ПредставлениеКурса = Формат(ЗаписьНабора.Курс, "ЧДЦ=4; ЧН=0; ЧГ=") 
					+ " " + Строка(ЗаписьНабора.БазоваяВалюта);
		Если ЗаписьНабора.Кратность > 1 Тогда
			ЗаписьНабора.ПредставлениеКурса = ЗаписьНабора.ПредставлениеКурса 
					+ " за " + Формат(ЗаписьНабора.Кратность, "ЧДЦ=; ЧН=??; ЧГ=")
					+ " " + Строка(ЗаписьНабора.Валюта);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбменДанными.Загрузка Тогда
		ОбменДанными.Получатели.Очистить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
